# **HOMEWORK ADVANCE DATAFRAME**
---
### Nama: Aldiva Wibowo
### Kelas: Data Science B

## **Pertanyaan 1**
### Buat tiga object DataFrame, dengan nama object = matakuliah, mahasiswa, nilai.

In [2]:
import pandas as pd

In [3]:
matakuliah = pd.DataFrame({
    'MKID': ['mk1', 'mk2', 'mk3', 'mk4'],
    'NamaMatakuliah': ['Database', 'Programming', 'Web-based-Programming', 'Basic Calculus']
})

mahasiswa = pd.DataFrame({
    'NIM': [101, 102, 103, 105],
    'Nama': ['Jane', 'Mike', 'Dave', 'Bambang']
})

nilai = pd.DataFrame({
    'NIM': [101, 101, 102, 103],
    'MKID': ['mk1', 'mk3', 'mk2', 'mk2'],
    'Nilai': [60, 80, 70, 95]
})

In [ ]:
matakuliah

  MKID         NamaMatakuliah
0  mk1               Database
1  mk2            Programming
2  mk3  Web-based-Programming
3  mk4         Basic Calculus

In [ ]:
mahasiswa

   NIM     Nama
0  101     Jane
1  102     Mike
2  103     Dave
3  105  Bambang

In [ ]:
nilai

   NIM MKID  Nilai
0  101  mk1     60
1  101  mk3     80
2  102  mk2     70
3  103  mk3     95

In [10]:
gabung_nilai = pd.merge(pd.merge(mahasiswa, nilai, how='left', on='NIM'), matakuliah, how='left', on='MKID')
gabung_nilai

   NIM     Nama MKID  Nilai         NamaMatakuliah
0  101     Jane  mk1   60.0               Database
1  101     Jane  mk3   80.0  Web-based-Programming
2  102     Mike  mk2   70.0            Programming
3  103     Dave  mk2   95.0            Programming
4  105  Bambang  NaN    NaN                    NaN

## **Pertanyaan 2**
### Buat object DataFrame, dengan nama object = matakuliah.

In [15]:
matakuliah = pd.DataFrame({
    'Mhs ID': ['001', '001', '001', '002', '002'],
    'Nama': ['Budi', 'Budi', 'Budi', 'Joko', 'Joko'],
    'Matakuliah': ['Kalkulus', 'Fisika', 'Basis Data', 'Programming', 'Basis Data']
})

matakuliah

  Mhs ID  Nama   Matakuliah
0    001  Budi     Kalkulus
1    001  Budi       Fisika
2    001  Budi   Basis Data
3    002  Joko  Programming
4    002  Joko   Basis Data

In [20]:
matakuliah['Dosen'] = matakuliah['Matakuliah'].apply(lambda x: 'Pak Agus' if x == 'Kalkulus' else
                                                     ('Pak Dwi'if x == 'Fisika' else
                                                      ('Bu Dian' if x == 'Basis Data' else 'Bu Susi')))

matakuliah

  Mhs ID  Nama   Matakuliah     Dosen
0    001  Budi     Kalkulus  Pak Agus
1    001  Budi       Fisika   Pak Dwi
2    001  Budi   Basis Data   Bu Dian
3    002  Joko  Programming   Bu Susi
4    002  Joko   Basis Data   Bu Dian